Revit 2027 API
PropertyLine.ConvertToTable Method
 Converts sketch based to table based
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ConvertToTable()
Public Sub ConvertToTable
public:
void ConvertToTable()
member ConvertToTable : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  PropertyLine is sketch-based. -or- PropertyLine contains some unsupported curve type, only line and arc are supported to convert to table. -or- Failed to convert to table if it is already a sketch-based PropertyLine. -or- Failed to convert to table if the sketch contains some other curve types like spline and ellipse, only line and arc are consider as valid curve type when convert to table. -or- Failed to convert if it is already table-based
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace